#pragma once

/************************************************************************/
/* NULL                                                                 */
/************************************************************************/
#ifndef NULL
#define NULL 0
#endif

/************************************************************************/
/* 单例                                                                  */
/************************************************************************/
#define SINGLETON_GETINSTANCE(T) \
public:\
	static T* getInstance()\
	{\
	static T* _pInstance = NULL; \
if (_pInstance == NULL)\
	_pInstance = new T; \
	return _pInstance; \
	}

#define SINGLETON(T) \
private:\
	T() {}\
	SINGLETON_GETINSTANCE(T)

/************************************************************************/
/* 指针校验                                                              */
/************************************************************************/
#define CONFIRM(p) {if(p==NULL){return;}}
